decision_tree_01234.mmd
graph TD
    n0["∅\nP"]
    n1["0\nN"]
    n2["01\nP"]
    n3["012\nN"]
    n4["0123\nN"]
    n5["01234\nP"]
    n6["0124\nP"]
    n7["013\nN"]
    n8["0134\nP"]
    n9["014\nN"]
    n10["02\nP"]
    n11["023\nN"]
    n12["0234\nP"]
    n13["024\nN"]
    n14["03\nP"]
    n15["034\nN"]
    n16["04\nP"]
    n17["1\nN"]
    n18["12\nN"]
    n19["123\nP"]
    n20["1234\nN"]
    n21["124\nN"]
    n22["13\nN"]
    n23["134\nN"]
    n24["14\nP"]
    n25["2\nN"]
    n26["23\nN"]
    n27["234\nN"]
    n28["24\nP"]
    n29["3\nN"]
    n30["34\nP"]
    n31["4\nN"]

    n0 --> n1
    n0 --> n17
    n0 --> n25
    n0 --> n29
    n0 --> n31
    n1 --> n2
    n1 --> n10
    n1 --> n14
    n1 --> n16
    n2 --> n3
    n2 --> n7
    n2 --> n9
    n3 --> n4
    n3 --> n6
    n4 --> n5
    n6 --> n5
    n7 --> n4
    n7 --> n8
    n8 --> n5
    n9 --> n6
    n9 --> n8
    n10 --> n3
    n10 --> n11
    n10 --> n13
    n11 --> n4
    n11 --> n12
    n12 --> n5
    n13 --> n6
    n13 --> n12
    n14 --> n7
    n14 --> n11
    n14 --> n15
    n15 --> n8
    n15 --> n12
    n16 --> n9
    n16 --> n13
    n16 --> n15
    n17 --> n2
    n17 --> n18
    n17 --> n22
    n17 --> n24
    n18 --> n3
    n18 --> n19
    n18 --> n21
    n19 --> n4
    n19 --> n20
    n20 --> n5
    n21 --> n6
    n21 --> n20
    n22 --> n7
    n22 --> n19
    n22 --> n23
    n23 --> n8
    n23 --> n20
    n24 --> n9
    n24 --> n21
    n24 --> n23
    n25 --> n10
    n25 --> n18
    n25 --> n26
    n25 --> n28
    n26 --> n11
    n26 --> n19
    n26 --> n27
    n27 --> n12
    n27 --> n20
    n28 --> n13
    n28 --> n21
    n28 --> n27
    n29 --> n14
    n29 --> n22
    n29 --> n26
    n29 --> n30
    n30 --> n15
    n30 --> n23
    n30 --> n27
    n31 --> n16
    n31 --> n24
    n31 --> n28
    n31 --> n30
